/* ============================================== */
console.log('==============================================');
console.log(`-  Створити функцію конструктор для об'єкту який описує теги \n Властивості \n -назва тегу \n - опис його дій \n - масив з атрибутами (2-3 атрибути максимум) \n Кожен атрибут описати як окремий який буде містити \n -назву атрибуту \n -опис дії атрибуту \n  інформацію брати з htmlbook.ru`);
console.log('Таким чином описати теги \n - a \n - div \n - h1 \n - span \n - input \n - form \n - option \n - select');
console.log(`Приклад результату { \n titleOfTag: 'area',\n action: 'Каждый элемент <area> определяет активные области изображения, которые являются ссылками...',\n attrs: [\n { titleOfAttr: 'accesskey', actionOfAttr: 'Переход к области с помощью комбинации клавиш' },\n { /*some props and values*/ },\n { /*...*/ },\n { /*...*/ },\n]\n}`);
console.log('==============================================');
/* ============================================== */
console.log('==============================================');
console.log(`-  Створити класс  для об'єкту який описує теги\nВластивості\n -назва тегу\n - опис його дій\n - масив з атрибутами (2-3 атрибути максимум)\n Кожен атрибут описати як окремий який буде містити\n -назву атрибуту\n -опис дії атрибуту\n інформацію брати з htmlbook.ru`);
console.log('Таким чином описати теги\n-a\n-div\n-h1\n-span\n-input\n-form\n-option\n-select');
console.log(` Приклад результату\n{\n titleOfTag: 'area',\n action: 'Каждый элемент <area> определяет активные области изображения, которые являются ссылками...',\n attrs: [\n{titleOfAttr: 'accesskey', actionOfAttr: 'Переход к области с помощью комбинации клавиш'},\n {/*some props and values*/},\n {/*...*/},\n {/*...*/},\n ]\n}`);
console.log('==============================================');
/* ============================================== */
console.log('==============================================');
console.log(`- Створити об'єкт car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:`);
console.log('-- drive () - яка виводить в консоль "їдемо зі швидкістю {максимальна швидкість} на годину"');
console.log('-- info () - яка виводить всю інформацію про автомобіль');
console.log('-- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed');
console.log('-- changeYear (newValue) - змінює рік випуску на значення newValue');
console.log(`-- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і доавляет його в поточний об 'єкт car`);
console.log('==============================================');
/* ============================================== */
console.log('==============================================');
console.log(`- Створити функцію конструктор яка дозволяє створювати об'єкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:`);
console.log('-- drive () - яка виводить в консоль "їдемо зі швидкістю {максимальна швидкість} на годину"');
console.log('-- info () - яка виводить всю інформацію про автомобіль');
console.log('-- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed');
console.log('-- changeYear (newValue) - змінює рік випуску на значення newValue');
console.log(`-- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і доавляет його в поточний об 'єкт car`);
console.log('==============================================');
/* ============================================== */
console.log('==============================================');
console.log(`- Створити клас який дозволяє створювати об'єкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:`);
console.log('-- drive () - яка виводить в консоль "їдемо зі швидкістю {максимальна швидкість} на годину"');
console.log('-- info () - яка виводить всю інформацію про автомобіль');
console.log('-- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed');
console.log('-- changeYear (newValue) - змінює рік випуску на значення newValue');
console.log(`-- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і доавляет його в поточний об'єкт car`);
console.log('==============================================');
/* ============================================== */
console.log('==============================================');
console.log(`-створити класс попелюшка з полями ім'я, вік, розмір ноги`);
console.log('--Створити 10 попелюшок , покласти їх в масив');
console.log(`--Сторити об'єкт класу "принц" за допомоги класу який має поля ім'я, вік, туфелька яку він знайшов.`);
console.log('-- за допоиоги циклу знайти яка попелюшка повинна бути з принцом');
console.log('==============================================');
/* ============================================== */
console.log('==============================================');
console.log(`-створити функцію конструктор попелюшка з полями ім'я, вік, розмір ноги`);
console.log('--Створити 10 попелюшок , покласти їх в масив');
console.log(`--Сторити об'єкт типу "принц" за допомоги функції конструктора з полями ім'я, вік, туфелька яку він знайшов, та функцію "пошук попелюшки"`);
console.log('-- функція повинна приймати масив попелюшок, та шукає ту котра йому підходить');
console.log('==============================================');
/* ============================================== */