/*==================================================================================================================================
1. присвоить каждому из следующих значений свою переменную: 'hello','owu','com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16, true, false 
Вывести каждую при помощи console.log , alert, document.write 
==================================================================================================================================*/

/* Обьявление и инициализация переменных */
let hello = 'hello';
let owu = 'owu';
let com = 'com';
let ua = 'ua';
let variableFirst = 1;
let variableSecond = 10;
let variableThree = -999;
let variableFour = 123;
let variableFive = 3.14;
let variableSix = 2.7;
let variableSeven = 16;
let variableTrue = true;
let variableFalse = false;

/* Вывод переменных на */
/* console.log */
console.log('String variables:')
console.log(hello);
console.log(owu);
console.log(com);
console.log(ua);
console.log('Decimal variables:')
console.log(variableFirst);
console.log(variableSecond);
console.log(variableThree);
console.log(variableFour);
console.log(variableFive);
console.log(variableSix);
console.log(variableSeven);
console.log('Bool variables:')
console.log(variableTrue);
console.log(variableFalse);

/* alert */
alert('String variables: ' + hello + ' ' + owu + '.' + com + '.' + ua);
alert('Decimal variables:');
alert(variableFirst + ', ' + variableSecond + ', ' + variableThree + ', ' + variableFour + ', ' + variableFive + ', ' + variableSix + ', ' + variableSeven);
alert('Bool variables: variableTrue = ' + variableTrue + '; variableFalse = ' + variableFalse + ';');

/* document.write */
document.write(`
                <h2>String variables:</h2>
                <h1>${hello} ${owu}.${com}.${ua}</h1>
                <h2>Decimal variables:</h2>
                <div>variableFirst = ${variableFirst}</div>
                <div>variableSecond = ${variableSecond}</div>
                <div>variableThree = ${variableThree}</div>
                <div>variableFour = ${variableFour}</div>
                <div>variableFive = ${variableFive}</div>
                <div>variableSix = ${variableSix}</div>
                <div>variableSeven = ${variableSeven}</div>
                <h2>Bool variables:</h2>
                <div>True variables = ${variableTrue}</div>
                <div>False variables = ${variableFalse}</div>
                `);

/*==================================================================================================================================
2. переопределить каждую переменную из задания 1 дав им произвольные значения.
Вывести каждую при помощи console.log , alert, document.write
==================================================================================================================================*/

/* Переопределение переменных */
hello = 'nike';
owu = 'just';
com = 'do';
ua = 'it';
variableFirst = -1;
variableSecond = -10;
variableThree = 999;
variableFour = -123;
variableFive = 4.13;
variableSix = 7.2;
variableSeven = -16;
variableTrue = false;
variableFalse = true;


/* Вывод переменных на */
/* console.log */
console.log('String variables:')
console.log(hello);
console.log(owu);
console.log(com);
console.log(ua);
console.log('Decimal variables:')
console.log(variableFirst);
console.log(variableSecond);
console.log(variableThree);
console.log(variableFour);
console.log(variableFive);
console.log(variableSix);
console.log(variableSeven);
console.log('Bool variables:')
console.log(variableTrue);
console.log(variableFalse);

/* alert */
alert('String variables: ' + hello + ' ' + owu + '.' + com + '.' + ua);
alert('Decimal variables:');
alert(variableFirst + ', ' + variableSecond + ', ' + variableThree + ', ' + variableFour + ', ' + variableFive + ', ' + variableSix + ', ' + variableSeven);
alert('Bool variables: variableTrue = ' + variableTrue + '; variableFalse = ' + variableFalse + ';');

/* document.write */
document.write(`
                <h2>String variables:</h2>
                <h1>${hello} ${owu}.${com}.${ua}</h1>
                <h2>Decimal variables:</h2>
                <div>variableFirst = ${variableFirst}</div>
                <div>variableSecond = ${variableSecond}</div>
                <div>variableThree = ${variableThree}</div>
                <div>variableFour = ${variableFour}</div>
                <div>variableFive = ${variableFive}</div>
                <div>variableSix = ${variableSix}</div>
                <div>variableSeven = ${variableSeven}</div>
                <h2>Bool variables:</h2>
                <div>True variables = ${variableTrue}</div>
                <div>False variables = ${variableFalse}</div>
                `);


/*==================================================================================================================================
3. Создать 3 числовых и 3 стринговых константы. Вывести каждую при помощи console.log , alert, document.write
==================================================================================================================================*/
/* Обьявление и инициализация констант */
const firstName = 'Dima';
const lastName = 'Dziubenko';
const fatherName = 'Vitaliyovuch';
const dayBirth = 2;
const mounthBirth = 11;
const yearBirth = 1987;

/* Вывод переменных на */
/* console.log */
console.log(firstName);
console.log(lastName);
console.log(fatherName);
console.log(dayBirth);
console.log(mounthBirth);
console.log(yearBirth);

/* alert */
alert(firstName + ' ' + lastName + ' ' + fatherName + ' ' + dayBirth + '.' + mounthBirth + '.' + yearBirth);

/* document.write */
document.write(`
                <h2>${lastName} ${firstName} ${fatherName}</h2>
                <h4>${dayBirth}.${mounthBirth}.${yearBirth}</h4>
`);

/*==================================================================================================================================
4. при помощи 3х разных prompt() получить 3 слова которые являются вашими ФИО. 
Для фамилии имени и отчества создать разные переменные. Вывести каждую при помощи console.log , alert, document.write
==================================================================================================================================*/
/* Обьявление и инициализация переменных */
let promptLastName = prompt('Введите вашу фамилию:');
let promptFirstName = prompt('Введите ваше имя:');
let promptFatherName = prompt('Введите ваше отчество:');

/* Вывод переменных на */
/* console.log */
console.log(promptLastName + ' ' + promptFirstName + ' ' + promptFatherName);

/* alert */
alert(promptLastName + ' ' + promptFirstName + ' ' + promptFatherName);

/* document.write */
document.write(promptLastName + ' ' + promptFirstName + ' ' + promptFatherName);

/* ==================================================================================================================================
5. Взять переменные из задания 4 и сконкатенировать их в одной переменной person.
==================================================================================================================================*/
let person = `${promptLastName} ${promptFirstName} ${promptFatherName}`;
console.log('person = ' + person);


/* ==================================================================================================================================
6. Взять задние 4 и 5 и применить его к ФИО всех членов своей семьи.
==================================================================================================================================*/
/* wife */
let firstNameWife = prompt('Введите имя вашей жены: ');
let lastNameWife = prompt('Введите фамилию вашей жены: ');

person = `${firstNameWife} ${lastNameWife}`;
console.log('person = ' + person);

/*daughter */
let firstNameDaughter = prompt('Введите имя вашего ребенка: ');
let lastNameDaughter = prompt('Введите фамилию вашего ребенка: ');

person = `${firstNameDaughter} ${lastNameDaughter}`;
console.log('person = ' + person);

/* ==================================================================================================================================
7. при помощи prompt() получить 3 числа. Привести их к числовому типу при помощи +. вывести их в консоль.
==================================================================================================================================*/
let firstNumber = +prompt('Введите любое число: ');
let secondNumber = +prompt('Введите любое число: ');
let thirdNember = +prompt('Введите любое число: ');

console.log(firstNumber, secondNumber, thirdNember);


/*==================================================================================================================================
8. при помощи prompt() получить 4 числа. Привести их к числовому типу при помощи parseInt. 
Сложить их между собой записав результат в переменную result и вывести в консоль браузера
==================================================================================================================================*/
firstNumber = parseInt(prompt('Введите любое число: '));
secondNumber = parseInt(prompt('Введите любое число: '));
thirdNember = parseInt(prompt('Введите любое число: '));
let fourNumber = parseInt(prompt('Введите любое число: '));

let result = firstNumber + secondNumber + thirdNember + fourNumber;
console.log(result);


/*==================================================================================================================================
9. при помощи prompt()  получить 3 числа с плавающей точекой. при помощи parseFloat привести их к соответсвующему типу. 
Сложить их между собой записав результат в переменную result и вывести в консоль браузера
==================================================================================================================================*/
firstNumber = parseFloat(prompt('Введите число с плавающей точекой: '));
secondNumber = parseFloat(prompt('Введите число с плавающей точекой: '));
thirdNember = parseFloat(prompt('Введите число с плавающей точекой: '));

result = firstNumber + secondNumber + thirdNember;
console.log(result);

/*==================================================================================================================================
10. при помощи prompt()  получить 3 числа с плавающей точекой. 
Округлить их при помощи Math.round Сложить их между собой записав результат в переменную  и вывести в консоль браузера
==================================================================================================================================*/
firstNumber = parseFloat(prompt('Введите число с плавающей точекой: '));
secondNumber = parseFloat(prompt('Введите число с плавающей точекой: '));
thirdNember = parseFloat(prompt('Введите число с плавающей точекой: '));

result = Math.round(firstNumber) + Math.round(secondNumber) + Math.round(thirdNember);
console.log(result);

/*==================================================================================================================================
11. при помощи prompt()  получить 2 целых числа. Привести их к целочисленному типу. 
Первое число - это число которое будут возводить в степень. 
Второе число - это число которое является степенью.
При помощи Math.pow возвести первое число в степень второго числа.
==================================================================================================================================*/
firstNumber = parseInt(prompt('Введите число которое будете возводить в степень: '));
secondNumber = parseInt(prompt('Введите число которое является степенью: '));

result = Math.pow(firstNumber, secondNumber);
console.log(result);

/*==================================================================================================================================
12. При помощи оператора опредеоения типа typeof определить типы следующих переменных и вывести их в консоль 
let a = 100; 
let b = '100'; 
let c = true; 
let d = undefined;
==================================================================================================================================*/

let a = 100;
let b = '100';
let c = true;
let d = undefined;

console.log(typeof a);
console.log(typeof b);
console.log(typeof c);
console.log(typeof d);

/*==================================================================================================================================
13. Поставьте соответствующий оператор в выражениях что бы получился соответсвующий результат.
В одинаковых выражениях в задании не использовать два одинаковых оператора.
Каждое выражение вложить в свою переменную
    5 ? 6 -> true
    5 ? 6 -> false
    5 ? 6 -> false
    5 ? 6 -> false
    10 ? 10 -> true
    10 ? 10 -> true
    10 ? 10 -> false
    10 ? 10 -> false
    10 ? 10 -> false
    123 ? '123' -> false
    123 ? '123' -> true
==================================================================================================================================*/
let variable1 = 5 < 6;
let variable2 = 5 > 6;
let variable3 = 5 >= 6;
let variable4 = 5 === 6;
let variable5 = 10 === 10;
let variable6 = 10 >= 10;
let variable7 = 10 != 10;
let variable8 = 10 > 10;
let variable9 = 10 < 10;
let variable10 = 123 === '123';
let variable11 = 123 == '123';

/*==================================================================================================================================
14. Дополнительно:
- Посмотрев на следюующие выражения, скажите, каков будет вывод в консоль
console.log(132 > 100 && 45 < 12 ); false
console.log(34 > 33 && 23 < 90 ); true
console.log(99 > 100 && 45 > 12 ); false
console.log(132 > 100 || 45 < 12 ); true
console.log(111 > 11 || 45 < 111 ); true
console.log((111 > 11 || 45 < 111) && (132 > 100 || 45 < 12) ); true
console.log((111 > 11 || 45 < 56) || (132 > 100 || 45 < 12) ); true
console.log((132 > 100 && 45 < 12 ) && (132 > 100 || 45 < 12 ) ); false
console.log((111 > 11 || 45 < 111) || (99 > 100 && 45 > 12 )); true
console.log(!!'-1'); true
console.log(!!-1); true
console.log(!!'0'); true
console.log(!!'null'); true
console.log(!!'undefined'); true
console.log(!!(3/'owu')); false
console.log((111 > 11 || 45 < 111) ||  !!'0'); true
console.log((!!111 == !!11 || 45 < 111) && (99 > 100 && 45 > 12 )); false
==================================================================================================================================*/


/*==================================================================================================================================
                                                            CLASS
==================================================================================================================================*/
/*==================================================================================================================================
1.Определите переменные str, num, flag и txt со значениями «Привет», 123, true, «true».
При помощи оператора typeof убедитесь, что значения переменных принадлежат типам: string, number и  boolean.
==================================================================================================================================*/
let str = 'Привет';
let num = 123;
let flag = true;
let txt = 'true';

console.log(typeof str);
console.log(typeof num);
console.log(typeof flag);
console.log(typeof txt);


/*==================================================================================================================================
2. Создайте переменные a1, a2, a3, a4, a5. При помощи математических операторов (сложение, вычитание и т.д.) найдите значения выражений:
    5 + 3,
    5 - 3,
    5 * 3,
    5 / 3,
    5 % 3
    поместив результат каждого выражения в соответствующую переменную. Например, let a1 = 5 + 3.
==================================================================================================================================*/
let a1 = 5 + 3;
let a2 = 5 - 3;
let a3 = 5 * 3;
let a4 = 5 / 3;
let a5 = 5 % 3;

console.log('a1 = ' + a1);
console.log('a2 = ' + a2);
console.log('a3 = ' + a3);
console.log('a4 = ' + a4);
console.log('a5 = ' + a5);


/*==================================================================================================================================
3.  Создайте переменные a6, a7, a8, a9, a10. Поместите в них результат выражений:
    5 % 3,
    3 % 5,
    5 + '3',
    '5' - 3,
    75 + 'кг'
==================================================================================================================================*/
let a6 = 5 % 3;
let a7 = 3 % 5;
let a8 = 5 + '3';
let a9 = '5' - 3
let a10 = 75 + 'кг';

console.log('a6 = ' + a6);
console.log('a7 = ' + a7);
console.log('a8 = ' + a8);
console.log('a9 = ' + a9);
console.log('a10 = ' + a10);

/*==================================================================================================================================
4. Напишите код, который находит площадь прямоугольника высота 23см. ( переменная height),
   шириной 10см (переменная width), значение площади должно хранится в числовой переменной s.
==================================================================================================================================*/
let height = 25;
let width = 10;
let s = height * width;
console.log('Площадь прямоугольника с высотой - 23см и шириной 10см равна ' + s + 'см');

/*==================================================================================================================================
5.  Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
результат поместите в переменную v.
==================================================================================================================================*/
let heightC = 10;
let dC = 4;
v = Math.PI * Math.pow((dC / 2), 2) * heightC;
console.log('Объем цилиндра высотой 10м и диаметром основания 4м равен = ' + v + 'm');

/*==================================================================================================================================
6. У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
  Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).
==================================================================================================================================*/
let n = 3;
let m = 4;
let k = Math.sqrt(Math.pow(n, 2) + Math.pow(m, 2));
console.log(k);


/*==================================================================================================================================
7. Напишите скрипт, который выводит "Hello world", создавши переменную str и выводить спомощью document.write, alert и console.log
==================================================================================================================================*/
str = "Hello world";
document.write(str);
alert(str);
console.log(str);


/* ==================================================================================================================================
8. Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби (каждой на новой строки спомощью \n).
==================================================================================================================================*/
alert('Дзюбенко Дмитрий \n' + '32 годочка \n' + 'Programming \n');

/*==================================================================================================================================
9. Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
   Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
   Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
   Вывести в документ содержимое переменной concatenation спомощью document.write
==================================================================================================================================*/
let str1 = 'Кто';
let str2 = 'ты';
let str3 = 'такой?';
let concatenation = str1 + ' ' + str2 + ' ' + str3;
document.write(concatenation);

/*==================================================================================================================================
10. Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
    let str = "20";
    let a = 5;
    document.write(str + a + "<br/>"); 205 - так как к первому строковому элементу с помощью конкатенации будет прикреплена переменная а
    document.write(str - a + "<br/>"); 15 - обратый эффект строка преобразовывается в число и происходит арифметическая операция
    document.write(str * "2" + "<br/>"); 40 - строка преобразовывается в число и происходит арифметическая операция
    document.write(str / 2 + "<br/>"); 10 - строка преобразовывается в число и происходит арифметическая операция
==================================================================================================================================*/

/*==================================================================================================================================
11. Какие значения выведет в окно консоли следующий фрагмент кода если его поместить в console.log?
    parseInt("3.14") 3 - строка парсится в целое число по этому откидывается остаток
    parseInt("-7.875") -7 - строка парсится в целое число по этому откидывается остаток
    parseInt("435") 435 - строка парсится в целое число
    parseInt("Вася") Nan - потомучто в строке нету числового значения
==================================================================================================================================*/

/*==================================================================================================================================
12.  С помощью окна ввода, вызываемого методом prompt, пользователь может ввести данные, которые будут использоваться далее,
повторите код ниже
    let str = prompt("Enter something", "ho-ho")
    console.log(str);
==================================================================================================================================*/


/*==================================================================================================================================
13. С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел, а вывод результата при помощи метода alert
==================================================================================================================================*/
let firstPromptVariable = +prompt('Введите первое число:');
let secondPromptVariable = +prompt('Введите второе число:');
alert(firstPromptVariable + secondPromptVariable);

/*==================================================================================================================================
14. С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя, фамилию и возраст, 
    а вам не обходимо вывести строку такого вида
    Доброго вечера Иван Иванов, мои поздравления что вам 32 , а вывод результата при помощи метода alert
==================================================================================================================================*/
let firstName14 = prompt('Введите ваше имя:');
let lastName14 = prompt('Введите вашу фамилию');
let age = prompt('Введите ваш возраст:');
alert('Доброго вечера ' + firstName14 + ' ' + lastName14 + ', мои поздравления что вам ' + age + '!');
alert(`Доброго вечера ${firstName14} ${lastName14}, мои поздравления что вам ${age}!`);



/*=====================
========ДОП============
======================*/

/*==================================================================================================================================
1. Три різних числа вводяться через prompt().
За допомоги if else вивести іх в порядку зростання. (відсортувати по зростанню)
==================================================================================================================================*/
let numOne = parseInt(prompt('Введите число:'));
let numTwo = parseInt(prompt('Введите число:'));
let numThree = parseInt(prompt('Введите число:'));


if (numOne < numTwo && numOne < numThree) {
    if (numTwo < numThree) {
        console.log(numOne, numTwo, numThree);
    } else {
        console.log(numOne, numThree, numTwo);
    }
} else if (numTwo < numOne && numTwo < numThree) {
    if (numOne < numThree) {
        console.log(numTwo, numOne, numThree);
    } else {
        console.log(numTwo, numThree, numOne);
    }
} else if (numThree < numOne && numThree < numTwo) {
    if (numOne < numTwo) {
        console.log(numThree, numOne, numTwo);
    } else {
        console.log(numThree, numTwo, numOne);
    }
}

/*==================================================================================================================================
2.
Все параматры получаем с клавиатуры!!!!
Имитируем поведение пешехода на перекстке.
Если светофор зеленый - вывести "иди".
Если светофор желтый - вывести "подожди".
Если светофор красный - вывести "стой".
Если светофор в аварийном режиме вывести "делай что хочешь"!
==================================================================================================================================*/
let colorTrafficLights = prompt('Введите один из цветов светофора! \n зеленый, желтый, красный');

switch (colorTrafficLights) {
    case 'зеленый':
        alert('иди!');
        break;
    case 'желтый':
        alert('подожди!');
        break;
    case 'красный':
        alert('стой!');
        break;

    default:
        alert('делай что хочешь!');
        break;
}

/*==================================================================================================================================
3
Все параметры получаем с клавиатуры!!!!(prompt , confirm)
Создать переменную isRoadClear которая характеризирует наличие на дороге машин.
Улучшаем предыдущее задание.
Если светофор зеленый и машин нет - вывести "иди".
Если светофор зеленый и машины есть  - вывести подожди пока нарушители проедут".
Если светофор желтый и машины есть - вывести "жди".
Если светофор желтый и машин нет - вывести "все рано жди".
Если светофор красный и машин нет- вывести "стой все рано".
Если светофор красный - и машины есть вывести "стой и жди".
Если светофор в аварийном режиме вывести "делай что хочешь"!
==================================================================================================================================*/

colorTrafficLights = prompt('Введите один из цветов светофора! \n зеленый, желтый, красный');
let isRoadClear = confirm('Есть ли машина на дороге?');

switch (colorTrafficLights) {
    case 'зеленый':
        !isRoadClear ?
            alert('иди!') :
            alert('подожди пока нарушители проедут!')
        break;
    case 'желтый':
        !isRoadClear ?
            alert('все рано жди!') :
            alert('жди!')
        break;
    case 'красный':
        !isRoadClear ?
            alert('стой все равно!') :
            alert('подожди пока нарушители проедут!')
        alert('стой и жди!');
        break;

    default:
        alert('делай что хочешь!');
        break;
}