/* 1 */
console.log('- Дана textarea.\nВ неё вводится текст.\nСделайте так, чтобы после захода на эту страницу через некоторое время, введенный текст остался в textarea.')
console.log('==========');
/* 2 */
console.log('- Дана форма с инпутами, текстареа, чекбоксами, радио кнопочками, селектами и тп.\nПользователь вводит какие-то данные и закрывает страницу (не факт, что он заполнил всю форму).\nСделайте так, чтобы при следующем заходе на страницу введенные им ранее данные стояли на своих местах.\nСделайте ваш скрипт как можно более универсальным.');
console.log('==========');
/* 3 */
console.log('-Дан текстареа. В него можно ввести данные, нажать кнопку "сохранить" и они "фикисруются" (в хранилище), затем поредактировать их, затем еще поредактировать и возможно еще.....\nТребование : хранить историю своих изменений (даже после перезагрузки страницы).\nСверху над текстареа должны появится стрелочки, с помощью которых можно перемещаться по истории (не забудьте!чекпоинт истории - нажатеи кнопки сохранить).');
console.log('==========');
/* 4 */
console.log('- Реализуйте записную книгу, хранящую данные в локальном хранилище.\nДанные которые надо сохранять : ФИО, номер, почта, фирма, отдел, день рождения\nДанные вводить через соответсвующую форму.\n--Каждому контакту добавить кнопку редактироваиня. При нажати на нее появляется форма, в которой есть все необходимые инпуты для редактирования, которые уже заполнены данными объекта');
console.log('==========');